uhnp/src/Documents/ПоступлениеВекселя/ПоступлениеВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеВекселя</name>
  <basedOn>Catalog.ЦенныеБумаги</basedOn>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПланОплат</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>InformationRegister.СтатусыАкцептаПереводныхВекселей</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>InformationRegister.ВерсииГрафиковРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентКонтрагент</registerRecords>
  <registerRecords>InformationRegister.РасшифровкиГрафиковЦБ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <attributes>
    <name>Акцептован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНоминала</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОснованияПоступления</name>
    <type>
      <types>EnumRef.ОснованияПоступленияВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаНачисленияПроцентов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияНачисленияПроцентов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорАкцепта</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовОснование</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовСТретьейСтороной</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйДоходРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредусмотренПроцентныйДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаДоходности</name>
    <comment>Вычисляется для дисконтных векселей; для процентных указана на векселе.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВзаиморасчетовСПлательщиком</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТретьяСторона</name>
    <comment>Третья сторона по переводному векселю. Для вида операции &quot;Акцепт переводного векселя&quot; - векселедатель, для вида операции &quot;Выпуск переводного векселя&quot; - плательщик.</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйИнструмент</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаВекселя</name>
    <type>
      <types>EnumRef.ФормаВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовФИРСБУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>График</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма начисления</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ВидСчетаФИ</name>
      <type>
        <types>CatalogRef.ВидыСчетовФИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОпераций</name>
    <attributes>
      <name>ОперацияГрафика</name>
      <type>
        <types>CatalogRef.ОперацииГрафиковДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проценты</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыУплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗадолженности</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/ВидыОперацийАкцептПротестПереводногоВекселя/ВидыОперацийАкцептПротестПереводногоВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийАкцептПротестПереводногоВекселя</name>
  <enumValues>
    <name>ПредъявлениеВекселяКАкцепту</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбАкцептеВекселя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПротестеПоВекселю</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОперацийПоступлениеВекселя/ВидыОперацийПоступлениеВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеВекселя</name>
  <enumValues>
    <name>ВыпускПростыхВекселей</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПереводныхВекселей</name>
  </enumValues>
  <enumValues>
    <name>АкцептПереводныхВекселей</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеВекселей</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ФормаВекселя/ФормаВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормаВекселя</name>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Переводной</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыФинансовыхИнструментов/ВидыФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыФинансовыхИнструментов</name>
  <enumValues>
    <name>РасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>КредитнаяЛиния</name>
  </enumValues>
  <enumValues>
    <name>КредитПолученный</name>
  </enumValues>
  <enumValues>
    <name>ЗаемПолученный</name>
  </enumValues>
  <enumValues>
    <name>Овердрафт</name>
  </enumValues>
  <enumValues>
    <name>ЗаемВыданный</name>
  </enumValues>
  <enumValues>
    <name>Депозит</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияПростая</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияВозобновляемая</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияОнкольная</name>
  </enumValues>
  <enumValues>
    <name>АккредитивВыданный</name>
  </enumValues>
  <enumValues>
    <name>АккредитивПолученный</name>
  </enumValues>
  <enumValues>
    <name>ГарантияВыданная</name>
  </enumValues>
  <enumValues>
    <name>ГарантияПолученная</name>
  </enumValues>
  <enumValues>
    <name>МНО</name>
  </enumValues>
  <enumValues>
    <name>Вексель</name>
  </enumValues>
  <enumValues>
    <name>Акция</name>
  </enumValues>
  <enumValues>
    <name>Облигация</name>
  </enumValues>
  <enumValues>
    <name>Факторинг</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеПривлечение</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>ВалютныйСвоп</name>
  </enumValues>
  <enumValues>
    <name>ВалютныйФорвард</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеЦенныеБумаги</name>
  </enumValues>
  <enumValues>
    <name>ВалютноПроцентныйСвоп</name>
  </enumValues>
  <enumValues>
    <name>ЛизингПолученный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПоступлениеВекселя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		ЗаполнитьПоВекселю(ДанныеЗаполнения)
	Иначе 
		ФинансовыеИнструментыУХ.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = Метаданные().Реквизиты.ВидОперации.ЗначениеЗаполнения;
	КонецЕсли;
	
	ЗаполнитьПараметрыОперацийПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ВидОперации = Перечисления.ВидыОперацийАкцептПротестПереводногоВекселя.УведомлениеОбАкцептеВекселя Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетВзаиморасчетовСПлательщиком");
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектРасчетовСТретьейСтороной) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетВзаиморасчетовСПлательщиком");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ФинансовыеИнструментыУХ.ОбработкаПроверкиЗаполнения_СчетаУчета(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеВекселя.АкцептПереводныхВекселей Тогда
		// По смыслу операции установим признак "Акцептован"
		Акцептован = Истина;
	КонецЕсли;

	ВстраиваниеУХФинансовыеИнструменты.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ВстраиваниеУХФинансовыеИнструменты.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ПереопределяемыеОбъектыУП") Тогда
		ВстраиваниеУХФинансовыеИнструменты.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
		Возврат;	
	КонецЕсли;

	ВстраиваниеУХ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ПоступлениеВекселя.ПодготовитьПараметрыПроведения(Ссылка, ДополнительныеСвойства, Неопределено, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВстраиваниеУХ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ВстраиваниеУХ.ЗагрузитьТаблицыДвижений(Движения, ДополнительныеСвойства, Отказ);
	
	ВстраиваниеУХ.СформироватьСписокРегистровДляКонтроля(ЭтотОбъект);	
	ВстраиваниеУХ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ВстраиваниеУХ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);	
	ВстраиваниеУХ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ВстраиваниеУХ.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыОперацийПоУмолчанию() Экспорт
	
	ТаблицаНастроек = РаботаСДоговорамиКонтрагентовУХ.ПараметрыОперацийГрафикаПоУмолчанию(ГруппаОперацийГрафика());
	ЭтотОбъект.ПараметрыОпераций.Загрузить(ТаблицаНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоВекселю(Вексель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.ВидФинансовогоИнструмента КАК ВидФинансовогоИнструмента,
	|	ЦенныеБумаги.ВалютаНоминала КАК ВалютаДокумента,
	|	ЦенныеБумаги.Ссылка КАК Вексель,
	|	ЦенныеБумаги.Номинал КАК Номинал,
	|	ЦенныеБумаги.Номинал КАК СуммаДокумента,
	|	ЦенныеБумаги.Номинал КАК СуммаОперации,
	|	ВЫБОР КОГДА ЦенныеБумаги.ПараметрыЦеннойБумаги.ФормаВекселя = Значение(Перечисление.ФормаВекселя.Простой)
	|		ТОГДА Значение(Перечисление.ВидыОперацийПоступлениеВекселя.ВыпускПростыхВекселей)
	|		ИНАЧЕ Значение(Перечисление.ВидыОперацийПоступлениеВекселя.ВыпускПереводныхВекселей) КОНЕЦ КАК ВидОперации,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.Векселедатель КАК ПараметрыЦеннойБумагиВекселедатель,
	|	ЦенныеБумаги.Эмитент.ОрганизационнаяЕдиница КАК Организация,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ПроцентнаяСтавка КАК СтавкаДоходности,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ДатаСоставления КАК Дата,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ПредусмотренПроцентныйДоход КАК ПредусмотренПроцентныйДоход,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ДатаНачалаНачисленияПроцентов КАК ДатаНачалаНачисленияПроцентов,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ДатаОкончанияНачисленияПроцентов КАК ДатаОкончанияНачисленияПроцентов,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ФормаВекселя КАК ФормаВекселя,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ДатаПлатежа КАК ДатаПлатежа,
	|	ЕСТЬNULL(ПоступлениеВекселейВекселя.Ссылка, ЗНАЧЕНИЕ(Документ.ПоступлениеВекселя.ПустаяСсылка)) КАК ПоступлениеВекселейСсылка,
	|	ЦенныеБумаги.ПараметрыЦеннойБумаги.ПервыйПолучатель КАК Контрагент
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеВекселя КАК ПоступлениеВекселейВекселя
	|		ПО (ПоступлениеВекселейВекселя.ФинансовыйИнструмент = ЦенныеБумаги.Ссылка)
	|			И (ПоступлениеВекселейВекселя.Проведен)
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Вексель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		//Нечего заполнять.
		Возврат;
	КонецЕсли;
	
	ДанныеВекселя = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
	Если ДанныеВекселя.ВидФинансовогоИнструмента <> Перечисления.ВидыФинансовыхИнструментов.Вексель Тогда
		ВызватьИсключение НСтр("ru = 'Для создания документа ""Регистрация векселей"" выберите ценную бумагу с типом ""Вексель""'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеВекселя.ПоступлениеВекселейСсылка) Тогда
		ПараметрыСообщения = Новый Структура("Вексель,Документ", Вексель, ДанныеВекселя.ПоступлениеВекселейСсылка);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
			НСтр("ru = 'Вексель [Вексель] уже зарегистрирован документом [Документ]'"), 
			ПараметрыСообщения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	// Заполнение шапки документа.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеВекселя);
	
	// Расчет графика
	ТабГрафик = ЦенныеБумагиУХ.ПолучитьГрафикНачисленияДоходаВексель(ЭтотОбъект, Дата);
	График.Загрузить(ТабГрафик);
	
КонецПроцедуры

Функция ГруппаОперацийГрафика()
	
	Возврат ?(ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеВекселя.ПриобретениеВекселей,
				Справочники.ОперацииГрафиковДоговоров.ВексельПолученный,
				Справочники.ОперацииГрафиковДоговоров.ВексельВыданный);

КонецФункции

#КонецОбласти

#КонецЕсли
